the
of
given
return
a
and
is
in
to
an
that
are
you
if
integer
array
number
where
with
be
it
each
for
can
all
n
1
from
two
or
any
there
0
one
at
by
not
string
such
as
integers
order
have
on
example
length
-
nums
following
i
same
x
no
has
0-indexed
will
this
note
only
may
minimum
2
after
maximum
ith
value
answer
k
sum
find
equal
possible
than
some
s
elements
its
which
between
first
must
then
every
true
binary
should
also
otherwise
we
positive
characters
more
into
so
left
strings
3
represents
list
-1
right
values
exactly
false
element
make
other
m
time
most
ie
times
numbers
2d
index
empty
nodes
both
size
them
contains
least
tree
your
int
different
j
they
sequence
row
valid
node
letters
representing
multiple
b
words
when
exists
choose
either
character
their
operation
count
unique
7
once
distinct
does
result
arrays
matrix
do
sorted
smallest
root
column
another
move
write
represented
consists
consisting
operations
adjacent
non-empty
want
indices
query
three
digits
total
range
cannot
grid
using
initially
type
within
implement
class
position
returns
numsi
contiguous
large
key
starting
largest
less
without
these
since
109
format
last
new
modulo
indicates
4
lowercase
next
ii
path
arr
but
remove
set
name
need
considered
5
contain
c
start
defined
containing
denotes
before
inclusive
initializes
end
pair
second
generated
get
even
greater
table
object
cell
target
above
substring
word
form
letter
subarray
up
consecutive
single
y
original
remaining
difference
take
guaranteed
english
numbered
function
called
add
sql
schema
primary
longest
edges
test
means
until
allowed
game
use
rules
digit
respectively
edge
conditions
design
moves
cells
non-negative
pairs
connected
strictly
input
reach
score
cases
zero
change
labeled
subsequence
point
needed
always
id
points
distance
current
while
however
leading
product
follows
exist
amount
four
could
deleting
check
replace
space
perform
6
appear
top
down
because
ways
assume
formed
void
group
starts
used
possibly
was
graph
square
step
numsj
positions
nums1
10
9
formally
steps
answers
answeri
queries
data
changing
t
day
case
way
very
1s
substrings
ai
represent
who
increasing
num
would
whose
ascending
person
rows
zeros
present
returned
linked
becomes
pick
resulting
structure
appears
takes
algorithm
bi
delete
many
jth
notice
search
edgesi
determine
part
odd
d
absolute
0s
head
ends
through
required
nums2
common
below
subarrays
xi
turn
impossible
smaller
lexicographically
swap
solution
r
undirected
removing
split
place
cost
line
been
numslength
final
shortest
non-decreasing
varchar
complete
itself
including
performing
convert
previous
good
moving
arri
val
task
representation
8
like
output
maximize
how
corresponding
process
still
direction
let
according
children
directly
about
chosen
made
equals
types
call
consider
initial
height
divisible
none
yi
price
z
alice
removed
palindrome
alphabet
groups
become
problem
go
decimal
along
null
spaces
people
among
except
information
average
separated
satisfies
ordered
32-bit
permutation
optimally
already
reverse
sort
whether
too
apply
divide
prefix
placed
kth
applying
bottom
out
highest
being
accepted
ones
uppercase
p
boolean
color
duplicate
board
goal
obtained
over
play
negative
occurs
report
infinite
insert
ab
were
written
occurrences
abc
duplicates
obtain
queriesi
occurrence
turns
1-indexed
define
subsequences
level
city
long
paths
date
those
minutes
pass
lower
added
bitwise
player
minimize
----------------------
concatenation
lengths
coordinates
si
bob
plane
playing
parent
area
wants
columns
during
solve
code
l
together
shown
beginning
leaf
child
players
simultaneously
water
entire
parentheses
complexity
squares
derived
subset
necessarily
xor
actual
special
construct
money
currently
side
relative
traversal
corner
instead
days
rearrange
back
ans
seconds
lists
bits
stones
travel
know
frequency
u
trees
calculate
keys
system
iii
arranged
extra
correct
select
user
greatest
partition
outside
flip
suppose
forward
o
interval
lowest
choosing
twice
described
build
based
concatenated
adding
connecting
e
put
create
directions
repeat
never
divided
built-in
results
subtree
stone
needs
replacing
closest
tie
third
found
rectangle
calls
said
just
100
per
fit
unit
bst
assigned
larger
endi
starti
vi
taken
receive
repeated
functions
describes
front
adds
mat
random
s2
s1
visited
top-left
full
employee
invalid
vertical
n-1
visit
bit
10-5
width
constraints
text
achieve
merge
bottom-right
he
east
denoting
leftmost
expression
ids
mentioned
denote
divisor
changed
circular
consist
inside
satisfy
nth
again
customer
signed
under
rotate
v
best
road
state
match
sums
map
prime
1st
units
ui
rounded
done
followed
exceed
see
item
11
standing
nums0
follow
max
arrlength
occur
------------------------
certain
nums1i
stop
keep
coordinate
students
power
horizontal
subtract
ansi
prices
gets
available
include
filled
run
removes
wordsi
finish
passed
costs
intervals
meaning
repeating
append
please
longer
trailing
maximized
immediately
arr1
land
addition
limit
location
pointsi
vertically
col
building
employees
upper
clockwise
places
condition
rest
minimized
names
123
assign
colors
deleted
buy
numsk
rearranging
method
pattern
increment
palindromic
backward
x-axis
might
diagonal
continue
several
scores
arrj
dictionary
sequences
4-directionally
round
replaced
his
differ
store
minute
student
users
12
assuming
rotation
box
increase
fewer
floor
wins
win
additional
modify
specific
destination
encoded
west
friends
directed
stops
reads
located
alternating
zeroes
middle
calculated
items
counted
division
ending
properties
weight
non-overlapping
ri
nearest
x1
horizontally
making
customers
reaches
asked
runs
well
iv
room
modified
sentence
sign
jump
f
wall
similarly
swaps
inserts
circle
2nd
print
concatenating
seats
around
transform
share
fits
cover
south
north
leaves
constructed
rightmost
flips
friend
walk
plus
network
arr0
higher
-----------------------
queue
moment
inserted
going
additionally
sell
intersection
base
leave
o1
neighbors
meets
played
rotated
solutions
depth
created
subsets
denoted
belongs
pointer
permutations
3rd
continuous
begin
robot
onto
due
fn
red
constant
rooted
vertices
h
pile
work
winner
file
white
blue
break
specifically
matches
25
our
cities
performed
belong
foreign
singly
version
now
off
colored
etc
decide
randomly
x2
uses
lexicographical
userid
beautiful
high
ordering
lefti
speed
car
remains
degrees
combination
non-zero
arithmetic
transactions
profit
holds
matching
earliest
wait
program
instance
center
26
stream
inputs
placing
pricei
piles
-------------------
salary
covered
what
later
company
leetcode
x-y
identical
13
rule
having
similar
hold
seat
stack
dollars
-x
rounds
suffix
pay
supports
events
event
request
satisfied
open
implementation
period
1000
requirements
righti
update
decrease
products
included
had
remain
stock
bidirectional
overlapping
swapping
cycles
arrive
latest
capacity
2n
tasks
timei
makes
applied
heights
hour
rectangular
sets
insertion
push
segment
collect
triplets
frequent
low
lets
say
free
w
shows
15
num1
num2
indicating
coins
probability
bool
boxes
image
subtrees
word1
word2
nums2i
operator
reversed
0th
language
anywhere
completely
mark
support
parts
message
orders
finding
tasked
y1
chessboard
replacement
fromi
toi
pieces
andor
multiply
90
numsi1
rank
traveling
rotating
maximal
manner
block
changes
balanced
brackets
mapping
abcde
combinations
axis-aligned
bottom-left
top-right
decreasing
taking
labels
comes
a2
she
decode
stored
reachable
hours
come
fixed
ranges
concatenate
rectangles
perfect
associated
help
cycle
segments
evaluates
expressions
piece
examples
double
intervalsi
series
01
nothing
obstacle
bank
finally
multiplication
much
slength
island
memory
answerlength
recall
candies
distribute
divides
generate
evaluate
source
weights
overlap
started
231
arbitrary
reconstruct
broken
house
own
indicate
nums2j
happens
earlier
subsequent
strs
requests
themselves
give
in-place
judge
c1
label
rearranged
card
kind
cards
absx
separate
preorder
deletions
pricesi
removal
modifying
radius
course
4th
descendant
particular
disjoint
significant
counts
far
a1
meet
roads
read
sorting
sides
versa
vice
chooses
accepts
g
satisfying
fully
costi
intersect
received
enum
factors
manager
shape
black
inserting
running
formatted
stonesi
half
arr2
descending
splitting
pushes
cut
vertex
stay
reduce
logs
reorder
vowels
across
ensure
alices
ignored
arrarrlength
321
queriesj
did
missing
forms
anagram
pop
choice
mean
others
picked
surrounded
future
thus
triangle
querieslength
parallel
exam
equivalent
doing
limited
notes
houses
transaction
balls
threshold
opposite
connection
y2
figure
enter
custom
five
symbol
hand
repeatedly
endpoints
23
trip
individually
nor
stores
productid
evenly
absi
non-increasing
grouped
phone
food
flipping
puzzle
sequentially
abcd
waiting
counting
tasksi
finished
boundary
drop
minimal
ancestor
earn
independent
towards
world
lines
parents
underlined
exact
draw
selected
operators
diagonally
1th
hhmm
worker
workers
partitioning
differences
content
answer0
answer1
factor
timestamp
generates
sit
alternate
toward
centered
nodeval
increases
provided
cardinal
contained
neighboring
movement
converted
decided
equally
101
removals
allow
able
obstacles
us
21
real
forming
checks
met
loses
online
encoding
deletion
wikipedia
simple
built
job
increments
vowel
composed
affect
definition
gridij
amongst
year
lose
here
indexed
q
palindromes
runtime
ci
bag
li
necessary
copy
olog
completed
regardless
automatically
transformation
ball
tile
addint
shares
visits
buildings
leaving
secret
website
r1
counterclockwise
50
subtraction
mod
rooms
property
positioni
cars
neither
-------------------------
perm
permi
street
blocks
partitions
fill
walls
address
c2
ace
merged
arrival
arrives
unknown
trying
public
threads
fourth
computer
video
locations
frequencies
132
valuesi
optimal
else
eat
pilesi
reference
whole
garden
log
numeric
allows
straight
traverse
pivot
employeeid
60
interpreted
30
falls
persons
access
record
00
0000
aa
writing
printed
coin
wrong
moved
divisors
walking
roots
facing
serialization
converting
shift
-3
candy
rating
country
pairsi
1234
compute
border
nice
excluding
reached
variable
lead
server
indirectly
distances
anagrams
shorter
partitioned
social
analysis
chunk
reset
sitting
happy
weighted
occupied
triplet
lie
works
previously
shapes
marked
jumps
age
idi
doesnt
positioned
small
closed
plant
sold
passes
away
testcases
fall
descendants
linear
continues
arrk
outgoing
collection
enough
sentences
tokens
20
yellow
nums1length
calendar
recursively
expected
emails
blocked
unless
symbols
instances
coming
determined
rearrangement
ranks
face
simplicity
104
root-to-leaf
painted
visiting
reformat
produce
cols
environment
named
disconnected
opening
department
mapped
22
courses
sj
station
bus
passengers
sub
beauty
thread
idle
outer
further
restaurant
bi-directional
roadsi
alphanumeric
appended
decoded
trips
chose
hi
ladder
green
computed
spend
goes
executed
her
super
endpoint
degree
y-axis
sent
messages
send
duration
milliseconds
instructions
repeats
keyboard
detect
heighti
container
rowi
filling
resultant
possibilities
office
corresponds
unlock
24-hour
security
causes
activity
intermediate
various
tests
entries
alphabetical
token
levels
existing
provide
guess
wi
train
magic
beyond
typed
attack
restrictions
overall
islands
shifting
components
uj
vj
local
email
periods
mountain
consecutively
2s
arrangement
arguments
05
k-th
answerj
maps
rolls
roll
dice
die
parameter
differs
reports
quality
field
sliding
unable
servers
returning
collected
14
describe
xth
media
explanation
chunks
api
solutionint
likely
calling
i1th
lost
candidates
team
unfortunately
calculator
iterator
daily
allocate
freely
proven
median
apple
preceding
conversion
diff
kinds
meeting
fibonacci
includes
evaluation
library
logsi
window
treat
constructor
slots
parenthesis
multiplied
partial
planted
question
quantity
compare
fair
customerid
accounts
supply
booking
inclusively
bags
shop
perimeter
tiles
falling
stand
16
-231
formula
handle
complement
weighti
languages
nested
successful
diagonals
pushint
school
hello
standard
procedure
varying
arrange
allocated
connects
phrase
010
games
night
robber
rob
decreases
selling
nums2length
endtime
my
starttime
repetition
connect
counter
x-coordinate
knight
configuration
eight
net
inorder
domain
rotations
keeps
-2
500
27
applies
simply
seven
nine
40
specified
yields
collide
checker
criteria
colorsi
erasing
remember
dashes
recover
immediate
gap
floors
engage
belonging
r2
month
getint
hamming
schedule
flatten
pointers
passenger
bar
cross
river
frog
turned
unlimited
spell
startpos
finishes
numerical
kilometers
baskets
basket
everyone
journey
grow
paint
acyclic
via
minus
compressed
travels
look
eating
bounds
i-th
pi
bitwise-xor
encode
rectanglesi
methods
getting
key-value
forever
separating
balloons
balloon
flowers
interface
coli
interested
competition
entering
cuts
script
unoccupied
machine
planning
direct
clear
counter-clockwise
self
appending
strange
2359
title
session
display
ever
domino
command
strength
quantities
calculation
denominations
001
averages
picking
slices
tallest
gridrc
clock
regular
--
arrows
main
sizes
matter
numi
a0
nums3
trivially
whenever
spiral
wordsj
buffer
serialized
shifts
wrapping
submatrices
dot
bobs
equation
dots
processed
pathsi
furthermore
statement
undefined
continuously
cause
paired
gain
peak
yj
restricted
non-space
begins
banned
generator
summation
working
project
error
compared
paid
ratio
numsn
try
numsl
resulti
dist
occurring
paper
numsleft
numsright
him
n2
passing
reaching
acb
section
route
bad
recent
135
decrement
numsnumslength
component
gcd
teams
rain
desired
assignment
hasnext
lands
s3
known
downward
expansion
dropped
jobs
topmost
huge
infected
bc
splits
skip
root1
root2
f1
rate
orderdate
--------------------------
hidden
distancei
valsi
star
ended
execution
tower
view
diagram
ugly
tournament
infinitely
min
recursive
xs
factorial
xy-plane
details
questions
solving
insertint
tickets
attend
calculates
boundaries
account
stick
seq
011
mini
wordslength
aj
close
queens
therefore
valuei
updates
19
indexing
euclidean
distributed
percentage
internal
sub-arrays
instantaneously
deletes
mathematical
robots
constructs
finds
neighbor
login
assigning
balance
amounts
aforementioned
causing
ki
ability
usual
disturbing
zigzag
simplified
0-9
triple
indicesi
ignoring
status
0100
better
composition
anything
visible
few
alerting
besides
contact
police
attain
valued
viewed
bookint
y-coordinate
manhattan
movements
gridrowcol
knows
owner
enters
customersi
teacher
expectednumsi
assert
expectednums
expectednumslength
assertions
leetcodecom
principle
ix
numerals
six
hands
xored
dollar
updated
avoid
speedi
occupy
aab
password
aba
volume
dimensions
non
commas
forgot
unchanged
staying
mouse
solved
255
validate
addresses
ip
closing
0-based
putint
hash
libraries
prerequisites
flattened
di
5th
catch
buses
len
alternately
crossing
abcc
requires
aligned
ring
press
decrypt
summary
collision
collisions
arrivali
preparing
gives
drives
drive
fruits
fnarri
i1
videos
alphabetically
temperature
ancestors
chars
in-order
non-leaf
income
amounti
accept
multiplicity
guards
eats
singly-linked
rangesi
xy
vali
parentsi
genetic
1-9
region
elapsed
cache
bounded
constraint
asks
restore
cpu
well-formed
flower
painting
monotone
str1
str2
postorder
filetxt
formats
partially
costsi
val1
val2
spreading
legal
boardrc
crosses
factory
calculations
keeping
mm
59
members
participating
member
cant
profiti
28
excel
sheet
finishing
3sum
merging
dominoes
individual
pos
comprise
losing
fractional
info
75
picks
structurally
bsts
experience
initialized
searchword
exceeds
warehouse
respective
forest
lock
assumed
choices
records
fifth
an-1
matrices
actions
tuples
parity
filter
contents
files
eventually
representations
link
deserialized
serialize
deserialize
restriction
submatrix
-9
tells
actually
06
giving
shared
listed
parenti
magical
non-intersecting
callback
frequently
preferred
pairings
judged
sub-array
extract
xj
existed
cj
evaluating
signal
delay
timesi
simulation
matrixs
years
pressed
hire
destroyed
unsorted
numsr
climb
17
connections
absnumsi
deepest
primes
cab
bef
colori
routes
listinteger
tweets
tweet
sk
happened
past
designed
height-balanced
testing
peoplei
fuel
liters
stations
elevation
ten
buckets
live
feed
poor
iterates
run-length
reminder
device
tell
relationship
nobody
sn
dies
dead
wish
completes
sometimes
resolve
blank
labelled
movie
movies
2020
afterward
lexicographic
itemsi
reuse
234
scheduled
obtaining
endtimei
starttimei
covers
comprises
plot
plots
pyramid
k-1
cutting
marking
nums1j
s0
swapped
spread
graphij
adjacency
1101
offers
sale
marks
disti
unlocks
targetsum
eaten
importance
folder
sales
exchange
market
vals
subgraph
pushed
execute
axes
2-dimensional
ranging
obstaclesi
lodashs
delayed
whereas
effect
precedence
left-to-right
treated
worked
staircase
quadruplets
happen
reading
unrooted
lying
planting
getrandom
regions
captured
locked
shuffling
themself
though
6-sided
force
productname
corners
ride
driving
objective
ties
plants
arriving
successive
flight
seatsi
pref
touches
receives
distributions
weightsi
heightsi
edgesj
maximizes
shuffle
respect
selecting
ranked
alength
sequential
erase
refer
chess
holding
shuffled
startvalue
entirely
attended
two-dimensional
uncolored
dont
handling
truncate
dividing
reduces
grid00
gridm
1n
origin
nesting
salaries
ingredients
positionsi
dates
contest
coefficient
violating
backwards
vice-versa
implemented
action
meetings
double-ended
deque
a3
uncommon
contrast
notation
res
arrleftright
placement
queen
subgrid
matij
stashed
jumping
successfully
variables
directory
fx
i0
312
numsk-1
implementing
half-open
attributes
64-bit
unsigned
reversing
pays
difficulty
unary
terms
simulate
stacks
depending
normal
odd-indexed
even-indexed
distribution
majority
gcdx
determines
departments
departmentid
guarantee
parser
logged
xn
arr1i
arr2j
arr1length
ranking
track
held
short
aaa
105
touching
appends
candiesi
24
aec
basic
apples
fraction
arrangements
reordered
graphi
appeared
sticks
xi1
typically
uniquely
110
p1
chain
bracket
capital
someday
cd
wordlist
instruction
wide
integral
stays
b2
behind
1-based
bulbs
switcher
turning
bulb
tour
smart
realized
entrance
article
views
fewest
tiling
countint
cartesian
knights
reside
transfer
requestsi
transfers
throughout
removeduplicatesnums
things
important
kept
dash
mail
spans
snake
900
xxvii
usually
roman
400
xii
numeral
iiii
xx
2k
worst
ranksi
case-sensitive
deck
unrevealed
entry
revealed
decki
firsti
single-space
discount
songs
song
meters
one-lane
fleet
collides
slowest
words1
words2
strong
180
mass
category
lined
furthest
decomposition
chunked
joined
formatting
great
walked
occupies
cat
disconnect
19216811
hexadecimal
upper-case
ipv4
removekey
buttons
overlapped
xcenter
ycenter
numcourses
prerequisitesi
curr
doubly
list2
list1
heads
natural
6th
labelsi
lower-case
departs
departure
-10
foo
frogs
landing
durationi
i-1th
groupsi
keyi
button
align
dial
metal
spelling
rings
startcol
home
startrow
addnumint
asteroid
asteroids
waits
chef
till
intersections
tripsi
fruit
bricks
ladders
sure
floating
expressed
awesome
dag
compression
separately
compress
correspond
afterwards
profitable
reward
batch
gone
1337
4237214
242
274
expiration
extended
faces
stands
performs
separation
rope
scheduler
cooldown
drawn
flowersi
bloom
took
gridrowicoli
movesi
tic-tac-toe
cook
pushing
prepending
80
movecost
unequal
pairwise
university
1100
02
456
bash
sub-boxes
sudoku
solvable
machines
scheduling
relationships
news
subordinates
processes
activities
float
activitytype
copies
invalidate
hh
groupi
sessions
numerically
restaurants
timej
halves
strengths
kingdom
weakest
army
buzz
fizz
fizzbuzz
printnumber
prints
console
extending
non-null
k1
nums2i2
squared
k2
energy
divisibility
edit
truncates
printer
displays
025
alphabetic
training
opponents
searchstring
transactionsi
comma-separated
locks
checked
mines
angle
polygon
convex
mutate
fashion
row-wise
ch
cipher
arrow
weak
parents0
robbing
book
increased
an-2
orange
oranges
4sum
boomerang
maintain
mixed
redistribute
cba
wordlength
wiggle
capitalization
reconstructed
serializationdeserialization
inputoutput
transmitted
yourself
3x
shiftsi
optional
guesses
reply
guessed
typei
traversed
filtered
grouping
11106
kjf
aajf
a-z
reduced
init
subjected
ratings
obeys
tables
show
startj
proved
powx
mode
prefers
preference
pairing
week
follower
invert
widths
insertstring
cousins
attempt
internally
tails
designated
rented
manages
speciali
equations
equationsi
ascii
case-insensitive
---------------------------
223
smash
maxsum
flipped
transpose
differing
scoresi
divisions
cream
boy
bars
ice
images
erased
borders
picky
critical
connectionsi
repaired
repair
warm
cup
cups
sake
describing
57
half-closed
communicate
targeti
recorded
monitor
120
210
10000
freq
frame
optimize
matrixij
resets
widthi
brings
provides
vote
skill
skills
liter
gas
tank
arrived
stationsi
miles
raining
trapping
trap
minimizes
wonderful
union
pig
allotted
bucket
fed
liquid
node1
node2
nextint
laser
interfere
join
plan
bijection
ticket
temperatures
everybody
identified
t2
t1
v1
v2
fancy
diameter
efficient
searches
situated
upcoming
yield
throws
const
cancelled
promise
thrown
shouldnt
reject
february
ant
col1
col2
row2
row1
abcdefuvwxyz
vyz
s1i
certainty
eggs
unbroken
breaks
egg
youre
farmland
inverse
abcdefghijklmnopqrstuvwxyz
ccc
triangles
contaminated
findint
rootval
shaped
contour
skyline
citys
viewing
save
puts
minitial
malware
0001
refers
shopping
rests
typing
012
safe
345
checking
entered
protected
incorrect
rollsi
favorite
imagine
folders
fresh
rotten
f0
orderid
related
ansj
rowj
colj
inner
researcher
citations
researchers
h-index
published
cited
papers
citationsi
executing
single-threaded
popped
exclusive
linked-list
cubes
3d
ages
agesi
conflict
older
bomb
1001
permute
numsnumslength-1
newnums
triangular
newnumsi
carries
carry
ij
identify
stairs
climbing
successor
someone
death
family
king
birth
cached
memoized
memoize
lot
loss
eliminate
burst
flat
bursting
shot
numsc
numsa
numsb
numsd
bug
quote
sourcei
effective
defines
floating-point
mirror
bridge
incomplete
gardens
skipped
coinsi
subjects
subject
halve
removeint
capture
os
roomsi
covering
fruitsi
produces
advance
tuple
matrixrowcol
similarity
objects
listnode
stonevalue
fs
outcome
rising
213
relations
respecting
traversing
success
buyerid
quarter
2019
sellerid
taxi
rides
colsum
managerid
boxesi
considering
redundant
definitely
sections
installed
processing
newly
instantly
master
sends
fi
race
capacities
2h
flights
dominoesi
sea
seqi
seqlength
drawing
distributing
maxtime
fulfilled
vii
hit
elimination
followerid
app
studentsj
sy
tx
ty
sx
bs
computers
minimums
concept
erasure
hits
disappear
attempts
stopped
n-queens
old
bj
iteration
0190
post
attending
eventsi
rational
2th
routine
whitespace
worry
ahead
faster
permitted
tries
vps
maxdeptha
deptha
vpss
depths
depthb
rods
delivery
service
install
installing
resources
spreads
uninfected
traffic
immutable
xxxx
collects
ticketsi
numsl1
numsr-1
ship
limits
port
summing
forwards
linked-lists
correctly
uniform
coloring
exit
maze
datetime
pad
multi-dimensional
penalty
meetingsi
copied
deep
isempty
isfull
rear
abcba
stamping
serve
a4
requirement
4567012
0124567
glass
collecting
layout
numarray
numarrayint
sumrangeint
queryint
self-edges
answerx
verifying
retrieves
bought
creating
growing
tonight
professional
replaces
tested
initialize
fee
sensitive
budget
fn-1
leads
partner
load
ideal
cyclic
slot
wheel
sij
independently
completing
operates
extension
eee
applications
managers
directories
filedirectory
73
transferred
involving
f3
rook
attacking
bishop
rooks
bishops
numsindex
popular
f2
circumference
numsn-1
numsk1
punctuation
pixels
categories
monthly
serving
appearing
keysi
decrypted
transformed
pj
limitj
specify
--------------------------------------
treenode
express
e1
context
convenience
evaluated
e2
innermost
coprime
foods
12345
parent0
k-sum
operating
safely
ground
supported
peek
natively
peekpop
fifo
1d
cheese
spent
optionally
h2o
indexes
repetitions
personid
denominator
doubled
cellsi
stopping
exceeding
buying
blength
examine
molecule
updateint
totally
-k
quotation
slash
appropriate
worth
replacements
relation
arr2length
bac
stacking
patterns
stacked
matched
studentid
bacd
lcm
108
tracker
lca
encodedi
bbb
maintained
triples
indexi
filtering
predict
potentially
layer
layers
enemy
truck
asynchronous
index1
index2
maxdistance
photo
mine
pascals
latter
escape
former
ignore
lr
got
originally
duplicated
preserved
queues
digitsi
dropping
leftright
traveled
richest
advances
mid
backspace
modifications
cookies
shifta
unused
party
infinity
tweetid
plate
sleftirighti
gains
a-b
recently
eval
chalkboard
instructed
non-equal
1010
java
32
compiler
stamps
retrieve
biggest
45
reporting
simulates
surface
drops
guarded
rightward
upon
tracks
excluded
bound
yyyy-mm-dd
0110
grammar
34
non-digit
numrows
slashes
watering
refill
plantsi
worddict
reused
segmentation
p0
fibonacci-like
xi2
asterisks
prefixes
maxi
p2
forth
populate
struct
populating
projects
logging
playerid
gamesplayed
eventdate
deviceid
loop
abbreviated
cheapest
yes
aeb
aebdc
idx
beginword
endword
efficiently
deposit
withdraw
incoming
withdrawint
depositint
reformatted
lies
trim
trimmed
carpetlen
tilesi
102
strategy
waste
stationary
ik
odd-numbered
enhances
acceptable
comma
powers
2-d
seed
targets
x3
18
situation
wasted
wooden
121241510
2510
-5
si1
growth
restrictionsi
modifies
nums2i1
rx
pre-order
driver
supposed
answersi
piecesi
decrements
active
companys
2x
term
spellchecker
converts
searchint
computing
aalength
intersecting
presses
packages
package
biginteger
gold
programming
commands
x0
nums0i
pointing
toggle
suffixes
thievery
himself
directly-linked
thief
weirdly
diminishing-valued
inventory
inventoryi
viewdate
viewerid
articleid
author
articles
viewer
authors
authorid
integer-sided
tot
findsumpairsint
nums2index
findsumpairs
side-length
k-booking
mycalendarthree
k-length
size1
costij
size2
scrambled
scramble
absx1
absy1
illustrates
gridrowcolth
cae
bce
season
achievable
grumpyi
grumpy
technique
bookstore
restart
chalk
chalki
4x
underscore
e-mail
e-mails
horizontalvertical
nn
n-2
multiplicand
nextvisit
nextvisiti
numsi-1
suitsi
flush
suits
poker
suit
reveal
secondi
preceded
1e5
music
boredom
listen
playlist
playlists
positioni1
carsi
unite
speeds
violates
alone
mirrored
categorize
heavy
bulky
comprising
store2
store3
store1
no-zero
fix
reinitialize
permn
beautifully
seperate
wrote
subtextk
subtexti
subtext1
subtext2
reformatting
firstly
depth-first
dfs
shifted
ccatmmouse
catjump
mousejump
crossword
patching
addpatch
patches
sumsecond
sumfirst
192168100
19216810
x1x2x3x4
20010db885a3000000008a2e03707334
20010db885a38a2e037j7334
192168011
020010db885a3000000008a2e03707334
xilength
queryip
x1x2x3x4x5x6x7x8
ipv6
2001db885a3008a2e03707334
rcenter
ccenter
revenue
janfebmaraprmayjunjulaugsepoctnovdec
hashmap
myhashmap
telephone
2-9
multilevel
single-level
currnext
splicing
cbad
buddy
sub-tree
busesi
passengersj
printfoo
foobar
printbar
assumes
trail
purpose
engraved
spelled
keyword
stage
fallout
door
freedom
quest
1200
anticlockwise
pressing
colcosts
colcostsc
homecol
homecoming
incurs
rowcosts
rowcostsr
homepos
homerow
getintervals
summaryranges
summarize
seen
echo
explode
odds
groupsize
straights
handi
prepares
prepare
tape
numpassengersi
pooling
vehicle
basket2
basket1
minbasket1ibasket2j
largest-valued
arraymap
returnedarrayi
dislikes
dislikesi
bipartition
dislike
hi1
watchedvideosi
watchedvideos
watched
friendsi
general
kelvin
celsius
fahrenheit
3200
27315
unidirectional
spot
sightseeing
valuesj
spots
cash
pricereward
gate
wrr
warrior
universal
backlog
ordertypei
ordersi1
ordersi
likes
bananas-per-hour
loves
koko
slowly
bananas
mink
fixed-bound
maxk
pow
extremely
superstring
trios
trio
tap
taps
watered
one-dimensional
dayi
stockpricesi
plotting
chart
stockprices
chat
sendersi
messagesi
sender
senders
parentsx
nodei
cdefghijklmn
abcdefghijklmnop
ab121p
arbitrarily
reindexing
4253
setting
un-expired
setkey
inaccessible
overwritten
getkey
anti-clockwise
10921
multiples
neededtimei
colorful
neededtime
properly
brokenletters
malfunctioning
forgotten
adjacentpairsi
adjacentpairs
slant
poeplei
snapshot
snapshotarrayint
getindex
snap
snapshotarray
setindex
snapid
array-like
bigger
tic
pending
tac
toe
indexs
monotonic
supersequence
bonus
pushcost
0954
normalized
fatigue
startat
finger
targetseconds
99
81
generic
54
normalizes
microwave
interprets
cooking
prize
prizepositionsi
prizepositions
prizes
operands
sqrt2
grades
emits
2351
keycard
saves
doors
keyname
2251
one-hour
0949
keytime
alert
key-card
keynamei
2352
keytimei
key-cards
recyclable
fat
lowfats
043
one-liner
7890
xxx
987-123-4567
xxx-xxxx
456-7890
xxx-xxx-xxxx
validated
washing
dress
dresses
interview
bcosti
acosti
fly
flying
lonely
urgent
headid
informtimei
subordination
inform
managerheadid
manageri
separates
battleships
battleship
rmove
cmove
min2
1235
12335
instructionsi
variation
zuma
distance3
distance1
distance0
distance2
12312
processingtime
machineid
processid
baseball
operationsi
minprofit
participate
commit
crimes
crime
scheme
schemes
participates
columnnumber
sessiontime
customernamei
tablenumberi
ordersicustomernameitablenumberifooditemi
fooditemi
header
graph1
grapha
hole
durations
bottoms
topsi
bottomsi
tops
strengthi
ruler
wizard
wizards
minsize
maxsize
maxletters
lengthwordj
lengthwordi
neg
utensil
pens
pencils
pencil
cost1
pen
cost2
printbuzz
fizzprintfizz
printfizzbuzz
numberprintnumber
multithreaded
buzzprintbuzz
fizzbuzzint
printfizz
fizzbuzzprintfizzbuzz
end-nodes
14312
1412
require
actuali
minimumi
word0i
divi
div
edits
089
0090089
9089
0090
275
avgsi
k-radius
avgs
nodeleft
noderight
traverses
k-bit
camelcase
non-bull
ask
hint
xayb
bulls
cows
075
pickindex
sumw
wlength
abe
energyi
defeat
opponent
initialexperience
initialenergy
experiencei
defeating
magicdictionary
builddictstring
7777
13579
3-1-5-9
myhashset
hashset
containskey
addkey
wrap-around
storekeeper
golf
acquire
curs
cur
relevant
gridxiyi
arms
minesi
monkeys
monkey
8-character
mutations
aaccggtt
endgene
investigate
mutation
startgene
gene
aaccggta
asdfghjkl
zxcvbnm
qwertyuiop
american
slanted
encodedtext
transposition
accessed
pr
originaltext
depict
ciphertext
arrlen
propertiesi
defensei
attackj
attacki
defensej
defense
multipliersi
multipliers1
multipliers
multipliers0
excellent
k-subarray
duty
gang
thieves
securityi
word2length
word1length
word2j
word1i
patterni
square-free
backsi
fronts
backs
frontsi
shelf
thickness
shelves
booksi
bookshelf
books
shelfwidth
thicknessi
bookcase
0144567
4567014
ababc
grid1
sub-islands
sub-island
grid2
kitchen
nums4
nums4l
nums3k
133
rounding
grayscale
img
smoother
surrounding
identifiers
letter-logs
digit-logs
space-delimited
identifier
printing
croakoffrogs
croaks
croaking
croak
southeast
cstart
rstart
grids
northwest
alike
abca
bcfd
abacba
ors
capitalize
capitalized
creative
clarification
serializes
approaches
directioni
abs
matxy
row1i
row2i
col2i
queryi
col1i
--6
-01
0089
99e25
314
e3
2e10
1a
-123456e789
-90e3
3e7
95a54e53
6e-1
535e93
1e
says
guessesj
lazy
verbal
3001
112
deci-binary
traversable
emailsi
aliceleetcodecom
everything
mynameemailcom
mails
alicezleetcodecom
myemailcom
forwarded
arrayreduce
fnval
fninit
reducer
subpath
descriptions
islefti
childi
descriptionsi
1221121221221121122
sex
temporary
ans0
ans1
listeners
callbacks
emitted
dom
emitter
subscribe
unsubscribe
subscriptions
nodejs
emitting
referentially
enables
eventemitter
emit
subscribing
subscribed
python
exponent
sqrtx
modes
occurred
preferences
preferencesi
unhappy
arr0k-1
sorts
pancake
3214
k-values
cabxbae
cabxe
ba
cxbae
prototype
floored
rj
0316227
3627
sumstring
overridden
key-val
mapsum
barcodesi
barcode
distant
barcodes
kn
face-up
revnumsi
rev120
revx
rev123
revnumsj
conversions
presented
interactive
submissions
mountainarraylength
circumvent
disqualification
mountainarr
mountainarrgetindex
mountainarray
mountainarraygetk
mountainarrayget
relaxation
contradiction
dj
paragraph
simulator
introduced
rollmax
rollmaxi
nim
heap
experienceyears
projectid
pressedkeys
texting
texts
2266622
transmission
qualityi
wage
expectation
wagei
93
92
329
2932
new1
new2
heaviest
complementary
explore
10th
tenth
theres
switching
absarri
sumnumsi-numsj
rungs
rung
zbax
262124
summer
sweltering
translate
translation
img1
img2
translated
hhhvv
hvhvh
providing
lucky
server-to-server
indexdiff
valuediff
consecint
parsed
datastreamint
datastream
matrixxy
n-repeated
1549
49
mechanics
mechanic
garage
cherries
pickup
cherry
thorn
def
adc
dfe
amount0
hot
dispenser
amount2
cold
dispense
amount1
145177
1412477
paintingj
mixj
rather
246
rightj
47
mix
thin
segmentsi
leftj
routes0
routesi
unusuable
wordsjk
tweetcountsgettweetcountsperfrequencyhour
site
tweetname
36107209
130189
721010000
70129
gettweetcountsperfrequencystring
tweetcounts
gettweetcountsperfrequency
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequency
1010000
6060
103609
86400-second
frequencys
059
nullnullnullnull221null4
recordtweetstring
analyzing
0210
60-second
1069
recordtweet
3600-second
997010000
tweet3
tweetcountsrecordtweettweet3
tweetcountsgettweetcountsperfrequencyminute
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
frontmost
pushmiddleint
pushbackint
popfront
popback
popmiddle
frontmiddleback
popping
pushfrontint
ping
recentcounter
pingint
3000
134
competitive
arrlefti
arrrighti
interchangeable
widthiheighti
width-to-height
widthjheightj
wraps
closer
director
directors
directorid
actorid
cooperated
actor
actors
actordirector
ax2
by1
ay2
bx1
by2
rectilinear
ay1
ax1
bx2
personsi
tied
cast
topvotedcandidate
topvotedcandidateint
election
votes
qint
reqskills
people1
people3
people0
sufficient
arrbannedi
bannedi
bring
refuel
startfuel
mile
fueli
transferring
refueling
non-prime
minlength
ababbc
baa
ac
abcbabcbcb
heightmap
abab
ccjjc
todelete
maxdoubles
pigs
poisonous
minutestotest
minutestodie
survive
consume
graphint
shortestpathint
edgecosti
addedgeint
edgecost
nummoves
380925
rle
exhausts
281825
exhaust
rleiteratorint
rleiterator
3825
encodingi
88855
exhausted
anti-theft
devices
activated
banki
while1
beam
beams
namely
equalize
guessint
pre-defined
px
airplane
combinationiterator
combinationiteratorstring
combinationlength
pos2v
pos2x
pos2y
pos2z
pos1x
pos1z
pos1v
pos1y
maxlocalij
maxlocal
warmer
1921681312
012201
0011255245
trusts
trust
town
trusti
rumor
secretly
tm
interleaving
t3
uk
vk
u2
u1
pruning
11110xxx
1-byte
octet
validation
utf8
0xxxxxxx
utf-8
1110xxxx
byte
unicode
translates
110xxxxx
bytes
-------------------------------------------------------------
10xxxxxx
n-bytes
british
under-population
conway
deaths
cellular
generation
1970
life
mathematician
john
lives
devised
reproduction
caused
interacts
automaton
over-population
births
wikipedias
horton
effort
hope
hiker
rows-1
hike
columns-1
heightsrowcol
rejects
settimeoutcancel
throw
settimeoutresolve
yielded
resolve2
promiseresolve
caught
t100ms
t50ms
cancel
responsibility
cancellabletasks
cancellable
resolved
promises
promisecatchconsolelog
mhts
minh
review
rated
movierating
createdat
movieid
prevroom0
prevroomi
colony
prevroom
col1row1col2row2
rth
colrow
exchanges
strs0strs0length
strs01
strs1strs1length
strs00
strs11
strs10
s2j
namei
rulekey
rulevalue
findmedian
medianfinder
fertile
pyramidal
apex
barren
bottommost
pyramids
farmer
za
pizza
c3
aabccc
a2bc3
03
additive
latin
consonant
applema
goat
made-up
ma
oatgma
inequality
illegal
rid
sslength
goods
conductor
mistake
treenodeleft
findelementstreenode
treenodeleftval
findelements
recovered
treenodeval
treenoderightval
treenoderight
recovers
prism
0-height
minnumsi
monday
tuesday
putting
sunday
hercy
exclusively
cornered
ssuffix
asuffix
sprefix
bsuffix
aprefix
bprefix
0011
1111
2p
offer
specialin
specialij
needsi
k-beauty
skipping
kmh
hoursbefore
letting
skips
peculiar
cracking
012345
sided
rolling
downwards
dailycapi
favoritedayi
candiescounti
favoritetypei
candiescount
33344the
trimmedsubarraylength
trimmed312434
3434
trimmedsubarray
1233344
trimmed1233344
sub-folder
folderi
filesystem
sub-folders
folderj
leetcodeproblems
rotting
elapse
commonly
2i
removequeriesi
removequeries
multiplying
searched
salesid
hiredate
salespersons
commission
alongside
salesperson
commissionrate
comid
lamps
answering
lampsi
illumination
illuminates
gridrowjcolj
illuminated
lamp
subexpr
subexpr1
logical
parsing
subexprn
subexpr2
differencesi
hiddeni
logarithmic
sqrt
drinking
numbottles
numexchange
drink
bottles
bottle
graphs
functionidstart
1end2
0start3
endtimestamp
l1
ln
l2
l0
heshe
positives
projections
projection
shadow
zx
planes
yz
looking
3-dimensional
lanes
obstacles2
lane
sideway
400ms
debounced
debounce
35ms
50ms
100ms
parameters
135ms
150ms
30ms
95ms
recieve
60ms
basketball
conflicts
younger
bombs
bombsi
detonated
felt
detonate
permuted
maximumbit
2maximumbit
variance
terminates
11001
boat
boats
detectsquares
perpendicular
childrens
evaluations
leavetimei
maxnumsj
mi
fixed-width
widest
throneinheritancestring
curorder
successorjack
whos
successorking
grandchildren
son
successorbob
throne
successorx
oldest
born
birthstring
deathstring
successoralice
childname
parentname
inheritance
jack
kingname
gave
getinheritanceorder
successorxs
well-defined
throneinheritance
factorialn
fib
fibn
strongest
soldiers
civilians
weaker
big
parking
parkingsystemint
park
cartype
medium
parkingsystem
addcarint
birthi
population
deathi
alive
monsters
chargethe
defending
charged
monster
weapon
haystack
needle
spherical
xend
y-direction
stretches
y-coordinates
xstart
taped
bx
az
bw
bz
bxy
underlying
subfolder
onetwothree
axy
ax
subfolders
yet
control
comment
implicit
newline
macros
comments
sample
statistics
countk
symmetric
incurred
newflowers
caretaker
questionsi
brainpower
brainpoweri
decision
deptid
taught
teaches
teacherid
subjectid
randomizedset
farm
strict
appeal
abbca
1-day
costs2
30-day
planned
365
costs1
costs0
7-day
answerrowcol
rankq
rankp
capable
favoritei
seating
organizing
invited
tars
arts
rats
serializations
12344
14234
transformable
homework
lays
querytime
fqueriesi
dcce
fw
winneri
losses
defeated
matchesi
loseri
text1
text2
magnetic
earth
stated
discovered
universe
c-137
morty
rick
invented
printnumber7
evenprintnumber
oddprintnumber
zeroevenoddint
zeroevenodd
010203040506
zeroprintnumber
everywhere
swim
beforeitemsi
dependencies
1e-5
succprobi
saledate
unitprice
2019-03-31
2019-01-01
mirrors
ray
receptor
receptors
reflection
southwest
tipi
willing
earnings
requesting
tip
ridesi
super-palindromes
super-palindrome
rowsumlength
colsumj
rowsumi
fulfills
colsumlength
rowsum
taller
30000
mall
transactionid
visitid
2d-array
accountsi
accountsi0
non-repeating
divider
dividers
corridor
decorative
originating
resending
channels
resend
channel
patiencei
periodically
replies
patience
tiresi
tires
changetime
numlaps
lap
laps
tire
rix-1
wisely
abovei
belowi
rowconditions
colconditions
rowconditionsi
colconditionsi
jugs
measurable
pour
jug2capacity
jug
measure
targetcapacity
jug1capacity
index-0
uniques
completeness
corporate
bookingsi
lasti
reserved
bookings
matchsticksi
matchsticks
matchstick
prefi
dominoesj
dominoeslength
k-increasing
arr5
arr3
arr4
arri-k
non-adjacent
heightsrc
oceans
atlantic
pacific
flow
ocean
nums10
nums11
nums21
nums20
nums1n
nums2n
arrx
arry
numarrows
ak
archery
scoring
shoots
bk
bobarrows
alicearrows
pool
maxchoosableinteger
desiredtotal
re-use
i-2th
001101
inspection
variety
official
marble
marbles
weightsj
bigram
pairslength
endi-1
streak
namesi
peoples
minjump
maxjump
bth
list1s
ath
player1
player2
pins
2xi
bowling
followers
advantage
highest-ranked
pricing
52372
numsliri
rects
rectsi
signfuncx
signfuncproduct
rearrangements
reordering
tilings
tromino
bbcbaa
aacabb
aecdb
unreachable
cables
ethernet
suggests
suggestions
suggested
successors
column-wise
hitsi
erasures
brick
stable
score25
score1
score0
90-degree
uniformly
illustrated
orthogonal
countuniquecharss
countuniquecharst
couple
couples
switch
gender
senior
citizens
naming
ideab
ideas
ideaa
jumbled
mappingi
maxbi
max3
maxci
max5
tripletsi
max2
maxai
tripletsj
6345
3456
0158
cycled
3951
hourglass
trains
depart
commute
107
zero-based
numsnumsi
startdayi
enddayi
querycharacters
queryindices
lengthsi
querycharactersi
queryindicesi
016
portion
repeatingpart
conventionally
1230001
123001212
integerpart
016666
integerpartnonrepeatingpart
212
nonrepeatingpart
integerpartnonrepeatingpartrepeatingpart
016666666
125
pictorial
thereafter
compact
sunny
one-line
wordstxt
pipes
unix
catches
slow
slower
fleets
bumper
orderwith
arri-1
dealing
8345
truncated
-27335
dividend
quotient
createcounter
aca
abaca
ca
references
x22
y22
depthc
r3g2b1
color-position
rod
recipesi
recipe
supplies
ingredientsi
recipes
2d-map
centre
ycentre
xcentre
rapidly
isinfected
modeled
threatens
affected
isinfectedij
virus
quarantine
human
stadium
visitdate
unmarked
sumregionint
sumregion
nummatrix
nummatrixint
36
bb
yy
abbxxxxzyy
stockspanner
span
todays
73412
quotes
today
7212
stocks
register
registered
contestid
username
decimals
man
lga
airports
lgb
airline
itineraries
lexical
itinerary
jfk
discard
dishes
like-time
satisfactioni
preparation
satisfaction
reducing
prepared
dish
2-bit
one-bit
1-bit
twos
maxweight
ports
delivered
portsi
loaded
delivering
maxboxes
portscount
storage
deliver
803
243801
801
243803
243
8-directionally
comprised
necesssarily
length-3
32-bits
01101
headb
intersected
lista
skipa
intersectval
skipb
heada
listb
retain
cnumselect
numselect
province
provinces
isconnected
isconnectedij
prefixi
argument
rand10
rand7
entrancecol
entrancerow
signup
confirmations
signups
expired
confirmation
confirming
requested
timeout
confirmed
justified
left-justified
maxwidth
approach
justification
greedy
pack
deeply
arrayflat
flattening
k-similar
maxoperations
progression
strs0
strs1
strs2
strsn
lockedi
secrets
firstperson
randomindex
xrandom
brand
89
124789
37
23489
finalsum
mycirculardeque
getfront
deletefront
deletelast
insertfront
mycirculardequeint
getrear
insertlast
1232
deviation
2234
stamp
targetlength
left-most
stamped
num1num2
soup
ml
mls
servings
splitted
3245
2582
well-performing
non-tiring
tiring
excess
glasses
pouring
pictured
poured
100th
champagne
omit
one-to-one
polish
operand
res0n-12
resr1c-2height-r-1
resrc
resr1c2height-r-1
2height1
tright
tleft
substitutions
enclaves
secondary
doll
envelopes
russian
rangefreqquery
rangefreqqueryint
sentencesi
rededgesi
blueedges
blueedgesj
rededges
surprisingly
alien
retrieving
getmin
minstack
grain
wood
subgrids
productkey
locationsi
locationsj
locationslength
graphical
consuming
pages
web
developer
page
self-dividing
128
x-matrix
meanwhile
logins
326
sneakily
d1
congratulate
mittal
danny
weekly
remap
d2
remaps
remapping
incompatibilities
incompatibility
univalue
superclass
classs
nestediterator
nestediteratorlistnestedinteger
iteratorhasnext
nestedlist
pseudocode
iteratornext
stonesj
reverses
ologm
ratios
brilliant
beforehand
passi
extrastudents
classesi
classes
totali
runningcostsi
maxchargetimes
chargetimesi
runningcosts
charge
sumrunningcosts
chargetimes
clock-wise
fk
arrk0
arrk1
arrkn
numwanted
uselimit
3-same-digit
dailysales
leadids
partnerid
partnerids
partners
makename
leadid
dateid
loadi
busy
i2th
handled
computational
busiest
divisor1
divisor2
uniquecnt1
uniquecnt2
wrap
deadends
wheels
codes
skl
totaltrips
successively
influence
histogram
histograms
expressive
helloo
lllll
ooo
hellooo
heeellooo
feeling
helllllooo
hiiii
oo
ll
stretchy
satisfiability
xiyi
equality
one-letter
xiyihere
earning
subsubdir1
subdirectory
subdir1
opened
file1ext
explained
looks
new-line
subsubdir2
subdirectories
dir
dirsubdir2subsubdir2file2ext
file2ext
tab
picture
abstracted
dirntsubdir1nttfile1extnttsubsubdir1ntsubdir2nttsubsubdir2ntttfile2ext
subdir2
nameextension
k-diff
bcdea
763
-55
-255
ns
transid
transactedon
punishment
solutionlistnode
preimage
f11
39916800
convention
allowedswaps
allowedswapsi
lakes
isnt
horizontallyvertically
pawn
captures
pawns
bababcba
bbabba
bba
creator
viewsi
idsi
popularity
creatori
platform
creators
fn-2
iquerieslength-1
p123m
circles
lattice
circlesi
additions
orderedstream5
osinsert2
ccccc
orderedstream
osinsert3
osinsert1
valuelength
orderedstreamint
concatentating
ddddd
idkey
bbbbb
aaaaa
osinsert5
eeeee
osinsert4
prior
mycalendar
truncating
hj
kj
reconstruction
queue0
queuej
pixel
imagesrsc
flood
sc
imageij
sr
20000
accountid
50000
removablelength
removable
sremovablei
donut
served
batches
bakes
batchsize
donuts
viii
divisorsi
maxcost
ti
decryption
encrypt
carried
encrypter
decryptstring
encrypts
encryption
encryptstring
encrypted
encrypterchar
substituted
substitution
appearance
workerj
difficultyi
5678
1238
5674
edgelist
edgelisti
qj
disi
existence
leaf-similar
precisely
customerprefdeliverydate
deliveryid
inserter
getroot
cbtinsertertreenode
cbtinserter
conventions
op1
adhere
negation
op3
op2
vn
scopes
expr
syntax
en
scope
lisp
parse
lisp-like
mult
pickint
validly
gcdval1
deliciousness
meal
deliciousnessi
meals
centennial
gondolas
scenario
runningcost
gondola
boardingcost
went
fortunately
observations
observation
insertions
spellsi
potion
spells
potions
potionsj
myqueue
1-dimensional
specialty
retail
quantitiesi
reward1
mice
reward2
reward2i
reward1i
leavebob
arrivebob
business
mm-dd
leap
5-character
rome
leavealice
arrivealice
31
autoincrement
atoms
h2o23
chemical
h2o2
h2o2he3mg4
atom
atomic
h1o2
formulas
sub-sequence
mysterious
func
funcarr
winston
-100
complex
realimaginaryi
imaginary
multiplications
i2
leftover
stack-like
freqstack
k-concatenation
is2
this1
sentence4
lastname
firstname
combine
addressid
fractions
less-than-or-equal-to
legs
puppy
eyes
devise
jobsi
difficulties
jobdifficulty
jobdifficultyi
dependent
0156
gift
numpeople
vacant
prison
univalued
uni-valued
enqueuetimei
act
processingtimei
kilograms
personname
turn1
turnn
ad
yqueeni
xqueeni
xking
queensi
yking
buys
repeatlimit
minalength
repeatlimitedstring
mycalendartwo
infection
molecules
oxygen
synchronization
barrier
bond
releaseoxygen
bind
enforces
barriers
releasehydrogen
hydrogen
explicitly
cashbacki
almost
jane
sentence1
sentence2
items2
items1
ret
reti
addelementint
mkaverage
mk
mkaverageint
calculatemkaverage
countj
pointsj
pointslength
basecostsi
flavor
flavors
dessert
topping
toppingcostsi
basecosts
toppingcosts
toppings
mutable
diffi
subtracted
particularly
reversal
1202
12300
reversed2
retained
reversed1
2021
fingers
constituent
dest
src1
lastly
src2
gt
apos
frasl
html
entity
entities
lt
quot
ampersand
amp
functioncall
totalcost
consolelogthe
taxcallpolyfillitem
appropriately
obj
tax10
callpolyfill
taxrate
salad
taxprice
thisitem
enhance
no-adjacent-flowers
flowerbed
24130
13024
computation
ea
efficiency
putnewi
righttoleftj
righttolefti
lefttorighti
regulate
warehouses
pickoldi
lefttorightj
bills
billsi
lemonade
bill
max6
max15
44
5247
567
xn-2
xn-1
4123
2143
4321
queuing
targetgrid
solid
targetgridrowcol
grandparent
even-valued
holes
pleasing
beneath
three-letter
aesthetically
transition
matchings
playersi
trainers
trainersj
trainer
countintervals
feedback
negativefeedback
studentidi
positivefeedback
reporti
cbda
acbd
startwords
targetwords
axyz
querychar
streamcheckerstring
streamchecker
xyz
non-coprime
minn
arranging
createhelloworld
requestaccepted
accepterid
requesterid
acceptdate
chemistry
skilli
greatness
permuting
reduction
nextlargest
frequencytracker
deleteoneint
regarding
hasfrequencyint
roundsi
marathon
sectors
rounds0
rounds1
circulate
sector
indiceslength
numsleft1
bitwise-and
absc1
pointsrc
arrayfilter
booleanvalue
filteredarr
truthy
ensures
addatheadint
mylinkedlist
indexth
prev
deleteatindexint
addatindexint
attribute
pointerreference
addattailint
gaining
tokensi
cyclically
fortsk
fortsi
maxij
fort
forts
minij
trucksize
numberofunitsperboxi
boxtypesi
numberofboxesi
boxtypes
exception
trues
confuse
answerkeyi
confusion
ts
answerkey
maximizing
truefalse
falses
millis
sleep
sleeps
numbersindex1
numberslength
numbersindex2
minima
maximaminima
mindistance
maxima
camera
cameras
connectivity
lockingtree
upgradeint
prevents
lockint
unlockint
locking
upgrade
lockingtreeint
upgraded
unlocked
sub-grid
quad-tree
isleaf
bottomright
sub-grids
bottomleft
recurse
wiki
proper
terminator
topright
signifies
topleft
quad
understand
toeplitz
spectators
allocates
scatterint
hall
hence
maxrow
gatherint
concert
vary
bookmyshow
bookmyshowint
ticketing
graphv
graphu
bipartite
clickc
minesweeper
char
revealing
clickr
click
weld
steel
billboard
welded
installation
5489355214
5489355241
5489355412
5489355421
smallest-valued
care
5489355142
secondlen
firstlen
averagearr
averagea
averageb
rowindexth
rowindex
dva
dv
options
fire
stayed
safehouse
grass
mat31
mat20
mat42
insensitive
12c
licenseplate
cbca
caaacab
abccdef
repetitively
abefcd
cdefab
efabcd
acdbef
cdabef
efcdab
abcdef
alal1ar
abaacc
mismatch
steal
homes
robbed
capability
refuses
steals
signs
stages
basically
sandwich
cafeteria
referred
lunch
sandwichesi
sandwiches
freezes
brushing
sidelengthi
landed
3-digit
travellers
travelleddistance
wealth
accountsij
signals
baaabb0
baaba0
sells
tastiness
addtextstring
editor
simulating
cursorposition
cursor
deletetextint
cursorleftint
min10
cursorrightint
texteditor
currenttextlength
unmodified
fntxtfncontent
f2content
f2txtf2content
f1txtf1content
f1txt
f1content
fntxt
rootd1d2dm
f2txt
directorypathfilenametxt
fncontent
123450
gi
cookie
greed
shiftx
shiftc
shiftsi-1
discovers
forget
discovering
aware
kencodedstring
3a
encodedstring
zzxy
xyzz
special-equivalent
xzzy
targetfriend
leavingi
chair
chairs
lengthi
lengthj
heightj
widthj
cuboid
cuboidsi
cuboids
jewels
plates
candle
candles
numsindex2
expressible
indexk
numsindex1
numsindexk
fish
fisher
outcomes
maxpts
loosely
plays
draws
probabilities
gridin
gridi
interesting
k-distant
ryan
abssum
homogenous
evict
lru
lrucacheint
lrucache
hasapplei
hasapple
dcbaefd
abcdefd
coordinatesi
abdc
dacb
subsequence2
subsequence1
exams
scoreij
presence
destroying
planet
asteroidsi
rewarded
eg
elementary
grade
352
math
submitted
n-ary
nary-tree
